Kelompok 14
1. Imam Rasyidin Syaputra (1301194448)
2. Muhammad Rafi Rahadian (1301194462)
3. Salsabila Martono (1301194469)

Download data test yang diberikan

In [ ]:
!gdown --id 1veoLpJWTuAPOLA9DBVRhlRwZ7tH3imir

Downloading...
From: https://drive.google.com/uc?id=1veoLpJWTuAPOLA9DBVRhlRwZ7tH3imir
To: /content/mobil.xls
100% 29.2k/29.2k [00:00<00:00, 53.0MB/s]

In [ ]:
import pandas as pd
from math import sqrt


df = pd.read_excel("mobil.xls")

df.sample(10)

         Nama Mobil  Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
2     Toyota Avanza       6           5     6          6                 2.0
11     Toyota Hiace      10           5     8          6                 5.0
10       Honda City       5           8     7          8                 2.7
6           Karimun       3           4    10          5                 1.2
7     Toyota Innova       8           8     5          7                 4.0
12  Toyota Fortuner       9           8     5          8                 5.0
13      Toyota Foxy       9           9     5          7                 5.5
1     Daihatsu Alya       4           3     9          6                 1.1
5            Livina       7           7     6          7                 2.1
15    Suzuki Ertiga       7           7     7          7                 2.3

In [ ]:
#summary table mobil.xls
df.describe()

          Ukuran  Kenyamanan       Irit  Kecepatan  Harga (Ratus Juta)
count  17.000000   17.000000  17.000000  17.000000           17.000000
mean    6.529412    6.352941   6.941176   6.823529            3.247059
std     2.034627    2.234423   1.784327   1.131111            2.406597
min     3.000000    3.000000   4.000000   5.000000            0.800000
25%     5.000000    4.000000   6.000000   6.000000            1.750000
50%     7.000000    7.000000   7.000000   7.000000            2.300000
75%     8.000000    8.000000   9.000000   8.000000            5.000000
max    10.000000   10.000000  10.000000   9.000000           10.000000

In [ ]:
#info table mobil.xls
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nama Mobil          17 non-null     object
 1   Ukuran              17 non-null     int64
 2   Kenyamanan          17 non-null     int64
 3   Irit                17 non-null     int64
 4   Kecepatan           17 non-null     int64
 5   Harga (Ratus Juta)  17 non-null     float64
dtypes: float64(1), int64(4), object(1)
memory usage: 944.0+ bytes

Table mobil.xls yang disimpan dalam varibel df bertipe Data Frame yang memiliki range data sebanyak 17 baris dengan 6 kolom


## Pre Processing

In [ ]:
#Mengecek data yang hilang
df.isna().sum()

Nama Mobil            0
Ukuran                0
Kenyamanan            0
Irit                  0
Kecepatan             0
Harga (Ratus Juta)    0
dtype: int64

Dari hasil pengecekan, tidak ada data yang hilang atau kosong

In [ ]:
#drop dan rename labels in column
df.rename(columns={"Harga (Ratus Juta)": "Harga"}, inplace=True)

test = df.drop(labels='Nama Mobil', axis=1)  #Harga pada data test akan di normalisasikan

test

    Ukuran  Kenyamanan  Irit  Kecepatan  Harga
0        4           4     9          6   1.00
1        4           3     9          6   1.10
2        6           5     6          6   2.00
3        6           4     6          6   1.75
4        7           7     6          7   2.25
5        7           7     6          7   2.10
6        3           4    10          5   1.20
7        8           8     5          7   4.00
8        9          10     4          8  10.00
9        5           7     9          8   2.50
10       5           8     7          8   2.70
11      10           5     8          6   5.00
12       9           8     5          8   5.00
13       9           9     5          7   5.50
14       5           9     7          9   6.00
15       7           7     7          7   2.30
16       7           3     9          5   0.80

In [ ]:
#Menormalisasikan harga menjadi di rentang 0-10
for i in range(len(test)):
    test["Harga"][i] = ((test["Harga"][i] - test["Harga"].min()) / (test["Harga"].max() - test["Harga"].min()))*10

test

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

    Ukuran  Kenyamanan  Irit  Kecepatan      Harga
0        4           4     9          6   0.217391
1        4           3     9          6   0.902222
2        6           5     6          6   1.822222
3        6           4     6          6   1.566667
4        7           7     6          7   2.077778
5        7           7     6          7   1.924444
6        3           4    10          5   1.004444
7        8           8     5          7   3.866667
8        9          10     4          8  10.000000
9        5           7     9          8   2.333333
10       5           8     7          8   2.537778
11      10           5     8          6   4.888889
12       9           8     5          8   4.888889
13       9           9     5          7   5.400000
14       5           9     7          9   5.911111
15       7           7     7          7   2.128889
16       7           3     9          5   0.595556

# Menghitung jarak menggunakan 4 metode

1. Euclidean Distance
2. Manhattan Distance
3. Minkowski Distance
4. Supremum Distance

In [ ]:
#Euclidean Distance
def euclidean_dist(test, train):
    dist = sum([(test[i] - train[i])**2 for i in range(len(train))])
    return round(sqrt(dist), 2)

#Manhattan Distance
def manhattan_dist(test,train):
    dist = sum([abs(test[i] - train[i]) for i in range(len(train))])
    return round(dist, 2)

#Minkowksi Distance
def minkowski_dist(test,train,p=2):
    dist = sum([abs(test[i] - train[i])**p for i in range(len(train))])
    return round((dist ** (1/p)), 2)
  
#Supremum Distance
def supremum_dist(test, train):
    return max([abs(test[i] - train[i]) for i in range(len(train))])

# Klasifikasi kNN 
Mencari 3 data yang berdekatan menggunakan metode euclidean, manhattan, minkowski, dan supremum.

In [ ]:
def kNN(test, train, k=3):
    euclidean = []
    manhattan = []
    minkowski = []
    supremum = []

    for i in range(len(test)):
        euclidean.append([euclidean_dist(test.iloc[i].tolist(), train), df['Nama Mobil'][i]])
        manhattan.append([manhattan_dist(test.iloc[i].tolist(), train), df['Nama Mobil'][i]])
        minkowski.append([minkowski_dist(test.iloc[i].tolist(), train), df['Nama Mobil'][i]])
        supremum.append([supremum_dist(test.iloc[i].tolist(), train), df['Nama Mobil'][i]])
    
    euclidean = sorted(euclidean)[:k]
    manhattan = sorted(manhattan)[:k]
    minkowski = sorted(minkowski)[:k]
    supremum = sorted(supremum)[:k]


    return euclidean, manhattan, minkowski, supremum

# Program Utama
Data train yang dicari disimpan dalam variabel, dan memanggil fungsi kNN yang sudah dibuat sebelumnya

In [ ]:
#Variabel yang digunakan dan data train yang akan di uji cobakan
train = [4, 5, 9, 5.5, 1]
euclidean = []
manhattan = []
minkowski = []
supremum = []

euclidean, manhattan, minkowski, supremum = kNN(test, train)

Mengeluarkan file rekomendasi mobil dari setiap metode

In [ ]:
data = [["Euclidean", euclidean], ["Manhattan", manhattan], ["Minkowski", minkowski], ["Supremum", supremum]]
recommended = []
recommended = pd.DataFrame(recommended)
for dist in data:
      print(f'\n{dist[0]} Distance')
      print("--------------------------------------------------")
      
      recommend = []

      for i, mobil in enumerate(dist[1]):
          print(f'{i+1}. {mobil[1]}, Jarak : {mobil[0]}')
          recommend.append(mobil[1])
      
      recommend = pd.DataFrame(recommend)
      recommend.rename(columns={0 : f"{dist[0]}"}, inplace=True)
      recommended = pd.concat([recommended, recommend], axis=1)
      
recommended.to_excel('Rekomendasi.xls', index=False)
recommended

Euclidean Distance
--------------------------------------------------
1. Toyota Agya, Jarak : 1.36
2. Karimun, Jarak : 1.8
3. Daihatsu Alya, Jarak : 2.06

Manhattan Distance
--------------------------------------------------
1. Toyota Agya, Jarak : 2.28
2. Daihatsu Alya, Jarak : 2.6
3. Karimun, Jarak : 3.5

Minkowski Distance
--------------------------------------------------
1. Toyota Agya, Jarak : 1.36
2. Karimun, Jarak : 1.8
3. Daihatsu Alya, Jarak : 2.06

Supremum Distance
--------------------------------------------------
1. Karimun, Jarak : 1.0
2. Toyota Agya, Jarak : 1.0
3. Daihatsu Alya, Jarak : 2.0

       Euclidean      Manhattan      Minkowski       Supremum
0    Toyota Agya    Toyota Agya    Toyota Agya        Karimun
1        Karimun  Daihatsu Alya        Karimun    Toyota Agya
2  Daihatsu Alya        Karimun  Daihatsu Alya  Daihatsu Alya